const PrivacyPolicy = `
모바일 앱 사이니(모바일 어플리케이션, 이하 ‘사이니’)는 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.

사이니는 개인정보처리방침을 개정하는 경우 모바일 앱 또는 웹사이트 공지사항(또는 개별공지)을 통해 공지할 것입니다.

○ 본 방침은부터 2019년 10월 25일부터 시행됩니다.

시행일 : 2019. 10월 25일
최종 변경일 : 2019. 10월 25일


용어 설명

- 블록체인은 블록에 데이터를 담아 체인 형태로 연결, 수많은 컴퓨터에 동시에 이를 복제해 저장하는 분산형 데이터 저장 기술을 뜻한다.
- 스마트 컨트랙트는 계약 조건을 실행하는 컴퓨터 트랜잭션 프로토콜을 지칭하며 일반적으로 블록체인 기술을 기반으로 계약 조건을 코딩하고, 조건에 부합하면 계약 내용이 이행되는 디지털 계약 방식을 뜻한다.
- 분산 ID(분산형 식별 시스템-DID, 이하 '분산 ID')는 일반적인 서비스 제공자 또는 개인정보 수집 및 관리 주체가 회원의 개인정보를 자신의 전산 장비에 저장하는 것이 아니라 사용자의 직접 동의와 적극적 제어권을 바탕으로 한시적 또는 일정한 조건 하에 정보 주체와 정보 대상, 정보 제공자, 정보 검증자, 정보 집합체들이 합의와 계약 하에 정보 주체의 개인정보를 블록체인과 스마트 컨트랙트를 통해 암호화해서 저장하는 방식을 뜻한다.   

1. 개인정보의 처리 목적 사이니(모바일 어플리케이션, 이하 ‘사이니’)는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
- 고객 가입의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별, 회원자격 유지 및 관리, 회원의 동의 하에 사이니가 제공하는 서비스 참여 및 이용, 물품 또는 서비스 공급에 따른 금액 결제, 물품 또는 서비스의 공급 및 배송 등


2. 개인정보의 처리 및 보유 기간

① 사이니는 정보주체 또는 분산 ID 인프라로부터 개인정보를 수집할 때 동의 받은 개인정보 보유 및 이용기간 또는 법령에 따른 개인정보 보유 및 이용기간 내에서 개인정보를 처리하고 보유합니다.

② 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.
- 고객 가입 및 관리 : 서비스 이용계약 또는 회원가입 해지 시까지
- 전자상거래에서의 계약 및 청약철회, 대금결제, 재화 등 공급기록 : 5년


3. 정보주체와 법정대리인의 권리와 의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.

① 정보주체는 사이니에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1. 분산 ID 인프라를 통해 사이니가 획득한 개인정보 열람권
2. 분산 ID 인프라와 연계하여 사이니가 획득한 개인정보의 기한 만료 시 자동 삭제 요구
3. 정보주체의 동의 하에 사이니의 서비스 이용에 따라 발생한 추가 정보 열람권
4. 정보주체의 동의 하에 사이니의 서비스 이용에 따라 발생한 추가 정보가 정보주체의 요구나 기한 만료 시 자동 삭제 요구



4. 처리하는 개인정보의 항목 작성

① 사이니는 다음의 개인정보 항목을 처리하고 있습니다.

- 필수항목 : 블록체인 기반 공개키
- 선택항목 : 이름, 이메일, 성별, 생년월일, 휴대폰, 거주국가
- 조건항목(스마트 컨트랙트에 의한 자동 생성과 만료) : 사이니의 서비스를 이용함에 따라 한시적 또는 조건적으로 발생하는 회원의 특정 배경 정보


5. 개인정보의 파기

① 사이니는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.

-파기절차
이용자가 입력한 정보는 직접 블록체인에 저장되거나 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.

-파기기한
이용자의 개인정보는 블록체인과 스마트 컨트랙트를 통해 한시적 또는 조건적으로 처리되는 경우를 제외하고 별도로 획득한 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.



6. 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항

① 팩토는 분산 ID 시스템의 원칙에 부응하고 개별적인 맞춤서비스를 제공하기 위해 이용자로부터 최소한의 이용 정보를 획득, 이를 이용자의 로컬 전자장비에 저장하며 필요 시 해당 정보를 읽어들이는 제한된 ‘쿠키(cookie)’ 이용 방식을 사용합니다. 쿠키는 이용자의 컴퓨터는 구별하지만 이용자를 개인적으로 식별하지는 않습니다.
가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 
나. 쿠키의 설치와 운영 및 거부 : 앱 브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부할 수 있습니다. 
다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.


7. 개인정보 보호책임자 작성


① 사이니는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보 보호책임자
성명 : 윤명환
직책 : 정보보안 책임
직급 : 대표
연락처 : 010-3200-3963 
※ 개인정보 보호 담당부서로 연결됩니다.

▶ 개인정보 보호 담당부서
부서명 : 정보보안
담당자 : 장윤정
연락처 : 010-8332-9954
// eslint-disable-next-line max-len
② 정보주체께서는 사이니의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 사이니는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.



8. 개인정보 처리방침 변경

①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.



9. 개인정보의 안전성 확보 조치 사이니는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적, 관리적 및 물리적 조치를 하고 있습니다.

1. 정기적인 자체 감사 실시
개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.

2. 개인정보 취급 직원의 최소화 및 교육
개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화하여 개인정보를 관리하는 대책을 시행하고 있습니다.

3. 내부관리계획의 수립 및 시행
개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.

4. 해킹 등에 대비한 기술적 대책
사이니는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신 및 점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하여 기술적, 물리적으로 감시 및 차단하고 있습니다.

5. 개인정보의 암호화
이용자의 개인정보는 암호화되어 저장 및 관리되고 있어 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

6. 접속기록의 보관 및 위변조 방지
개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관 및 관리하고 있으며, 접속 기록이 위변조 및 도난되거나 분실되지 않도록 보안기능을 사용하고 있습니다.

7. 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통해 개인정보의 접근통제에 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

8. 문서보안을 위한 잠금장치 사용
개인정보가 포함된 서류, 보조저장매체를 보유하지 않는 것이 원칙이나 일시적 또는 불가피하게 보유할 경우 잠금장치가 있는 안전한 장소에 보관하고 있습니다.

9. 비인가자에 대한 출입 통제
개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.



10. 정보주체의 권익침해에 대한 구제방법

아래의 기관은 사이니와는 별개의 기관으로서, 사이니의 자체적인 개인정보 불만처리, 피해구제 결과에 만족하지 못하시거나 보다 자세한 도움이 필요하시면 문의하여 주시기 바랍니다.

▶ 개인정보 침해신고센터 (한국인터넷진흥원 운영)
- 소관업무 : 개인정보 침해사실 신고, 상담 신청
- 홈페이지 : privacy.kisa.or.kr
- 전화 : (국번없이) 118
- 주소 : (58324) 전남 나주시 진흥길 9(빛가람동 301-2) 3층 개인정보침해신고센터

▶ 개인정보 분쟁조정위원회
- 소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)
- 홈페이지 : www.kopico.go.kr
- 전화 : (국번없이) 1833-6972
- 주소 : (03171)서울특별시 종로구 세종대로 209 정부서울청사 4층

▶ 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)
▶ 경찰청 사이버안전국 : 182 (http://cyberbureau.police.go.kr)

`;

// max-len
const TermsOfUse = `
제1장 총칙

제1조 (목적)
이 서비스 약관은 회원이 사이니(모바일 앱 사이니, 이하 “사이니”)에서 제공하는 인터넷 및 블록체인 관련 서비스(이하 “서비스”)를 이용하면서 회원과 사이니 간의 권리, 의무 및 책임사항, 회원 가입과 서비스 이용에 필요한 이용조건 및 절차 등의 기본적인 사항을 규정함을 목적으로 합니다.


제2조 (약관의 효력 및 변경)
약관의 내용은 서비스 화면에 게시하고 이용자가 동의함으로써 효력이 발생합니다. 사이니는 합리적인 사유가 발생할 경우에는 이 약관을 변경할 수 있으며, 약관이 변경되는 경우 최소 7일 전에 공지합니다.
또한, 새로운 서비스가 개설될 경우 별도의 명시된 설명이 없는 한 이 약관에 따라 제공됩니다.

1. 본 약관은 사이니가 서비스 화면을 통해 게시하고 이용자가 이에 동의함으로써 효력이 발생합니다.

2. 사이니는 "약관의 규제 등에 관한 법률", "정보통신망 이용촉진 및 정보보호 등에 관한 법률", "개인정보보호법" 등 관련 법령을 위반하지 않는 범위에서 이 약관의 내용을 수정하거나 변경할 수 있습니다.

3. 사이니는 약관을 개정할 경우에는 적용 일자 및 개정사유를 명시하여 현행 약관과 함께 그 적용 일자 7일 이전부터 적용 일자 전날까지 서비스 화면에 알립니다.

4. 사이니가 전항에 따라 알리면서 고지일로부터 개정약관 시행일 7일 후까지 거부 의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 알렸음에도 의사표시가 없는 경우 변경된 약관을 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 제7조 제1항의 규정에 따라 이용계약을 해지할 수 있습니다.


제3조 (약관 외 준칙)
이 약관에 명시되지 않은 사항에 대해서는 전기통신기본법, 전기통신사업법 등 관계 법령 및 사이니가 정한 서비스의 세부이용지침 등의 규정에 의합니다.


제4조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

1. 이용자: 사이니가 제공하는 서비스를 받는 회원과 비회원

2. 회원: 사이니와 서비스 이용계약을 체결하고 이용자 자격을 부여받은 자

3. 비회원: 회원에 가입하지 않고 사이니가 제공하는 서비스를 이용하는 자

4. 블록체인: 블록에 데이터를 담아 체인 형태로 연결, 수많은 컴퓨터에 동시에 이를 복제해 저장하는 분산형 데이터 저장 기술을 뜻합니다.

5. 스마트 컨트랙트: 계약 조건을 실행하는 컴퓨터 트랜잭션 프로토콜을 지칭하며 일반적으로 블록체인 기술을 기반으로 계약 조건을 코딩하고, 조건에 부합하면 계약 내용이 이행되는 디지털 계약 방식을 뜻합니다.

6. 아이디(ID): 일반적으로 회원식별 또는 회원의 서비스 이용을 위하여 회원이 설정하거나 부여받은 문자 또는 숫자의 조합이지만, 사이니는 직접 분산 ID 서비스를 제공함으로써 회원의 공개키를 할당하거나 다른 분산 ID 서비스 제공자로부터 회원의 공개키를 부여받아 아이디 용도로 사용합니다.

7. 분산 ID(분산형 식별 시스템-DID, 이하 '분산 ID'): 일반적인 서비스 제공자 또는 개인정보 수집 및 관리 주체가 회원의 개인정보를 자신의 전산 장비에 저장하는 것이 아니라 사용자의 직접 동의와 적극적 제어권을 바탕으로 한시적 또는 일정한 조건 하에 정보 주체와 정보 대상, 정보 제공자, 정보 검증자, 정보 이용자, 정보 집합체들이 합의와 계약 하에 정보 주체의 개인정보를 블록체인과 스마트 컨트랙트를 통해 암호화해서 저장하는 방식을 뜻합니다.

8. 분산 ID 이용 어플리케이션(분산 ID App, 이하 '분산 ID 앱''): 일반적인 서비스 제공자 또는 개인정보 수집 및 관리 주체가 회원의 개인정보를 자신의 전산 장비에 저장하는 것이 아니라 사용자의 직접 동의와 적극적 제어권을 바탕으로 한시적 또는 일정한 조건 하에 정보 주체와 정보 대상, 정보 제공자, 정보 검증자, 정보 이용자, 정보 집합체들이 합의와 계약 하에 정보 주체의 개인정보를 블록체인과 스마트 컨트랙트를 통해 암호화해서 저장하는 방식을 뜻합니다.  

9. 비밀번호: 일반적으로 회원의 정보 보호를 위해 회원 자신이 설정한 문자 또는 숫자의 조합이나, 사이니는 분산 ID 시스템을 통해 공개키와 비밀키를 할당하거나 부여할 뿐 별도의 비밀번호 시스템을 제공하지 않습니다.

10. 연결 사이트: 홈페이지와 하이퍼링크 방식(하이퍼링크의 대상에는 문자, 정지 및 동화상 등이 포함됨)등으로 연결된 웹 사이트 또는 앱의 이동 방식을 말합니다.

11. 운영자: 서비스의 전반적인 관리와 원활한 운영을 위하여 사이니에서 선정하거나 사이니 서비스 이용자나 관계자 중에서 일정한 권한을 부여받아 사이니 운영에 관련된 권한을 부여받은 자

12. 개인정보: 당해 정보에 포함된 이름, 이메일 주소 등의 사항에 의하여 특정 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 인식할 수 없더라도 다른 정보와 쉽게 결합하여 식별할 수 있는 것을 포함)

13. 해지: 이용자가 서비스 개통 후 이용계약을 해약하는 것



제2장 회원의 가입 및 탈퇴


제5조 (회원 가입)

1. 이용자는 사이니가 직접 제공하는 분산 ID 서비스 또는 다른 분산 ID 시스템 제공자를 통해 사이니로 연결할 수 있으며 이때 사이니가 정한 절차와 양식에 따라 약관에 동의한다는 의사표시를 함으로써 회원 가입을 신청합니다.

2. 사이니는 전항과 같이 회원으로 가입할 것을 신청한 이용자 중 이하 각 호에 해당하지 않는 한 회원으로 등록합니다.
1). 가입 신청자가 본 약관 제7조 제2항에 따라 이전에 회원 자격을 잃은 적이 있는 경우
2). 회원으로 등록하는 것이 사이니의 기술상 또는 업무 수행상 현저히 지장이 있다고 판단하는 경우
3). 만 14세 미만의 아동

3. 회원 가입계약의 성립시기는 사이니가 승낙한 시점으로 합니다.


제6조 (회원 정보의 변경)


1. 회원은 사이니가 직접 제공하는 분산 ID 서비스 또는 사이니와 연결된 다른 분산 ID 시스템 제공자의 개인정보관리화면을 통하여 회원의 개인정보를 열람하고 수정할 수 있습니다. 

2. 사이니의 분산 ID 서비스를 이용하는 분산 ID 앱 이용 도중에 해당 서비스를 통해 수집된 회원 정보는 해당 분산 ID 앱의 개인정보관리화면을 통하여 회원의 개인정보를 열람하고 수정할 수 있습니다. 

3. 회원은 사이니 이용 신청 시 또는 이용 도중에 기재한 회원정보가 변경되었을 경우 변경하지 않은 정보로 인해 오류 또는 문제가 발생할 경우 해당 책임은 회원에게 있습니다.



제7조 (회원 탈퇴 및 자격상실 등)

1. 사이니의 회원 정보 시스템은 분산 ID 기반으로 운영됨에 따라 회원은 탈퇴를 희망할 경우 탈퇴를 요청할 수 있으나 사이니의 처리 절차는 아래와 같이 분산 ID 이용 환경에 따라 달라집니다.

1) 사이니가 분산 ID 서비스를 직접 제공하는 경우
- 회원이 사이니의 분산 ID 서비스에 탈퇴 요청 시 사이니는 사이니의 분산 ID 서비스에 수집된 회원의 개인정보와 맞춤 설정된 개인화 정보에 대해서만 초기화를 하며, 이때 사이니와 연동된 분산 앱에 대한 연결을 모두 끊으며 자동으로 회원 탈퇴를 합니다. 회원은 사이니의 블록체인 시스템에 공개키에 대응하는 비밀키를 직접 소유하고 있으므로 언제든지 계정 정보를 초기 상태로 복원할 수 있으며, 회원의 개인키에 자산이 있을 경우 사이니 또는 사이니의 분산 ID와 호환되는 블록체인 시스템을 통해 직접 자산에 접근하고 제어할 수 있습니다.

2) 사이니가 아닌 다른 분산 ID 서비스를 통해 사이니와 연결된 경우
- 회원이 사이니의 분산 ID 서비스에 탈퇴 요청 시 사이니는 사이니에서만 수집되거나 보관 중인 회원 개인정보와 맞춤 정보를 초기화 합니다. 회원은 사이니 외부에 최초로 비밀키를 생성한 서비스 제공자가 있거나 별도의 개인정보나 맞춤 정보가 있을 경우 해당 서비스 제공자에게 추가로 탈퇴를 요청해야 합니다.  

3) 사이니의 분산 ID 서비스를 이용하는 다른 분산 앱이 있을 경우
- 사이니의 분산 ID 서비스를 이용하는 다른 분산 앱에 추가로 수집된 회원의 개인정보가 있을 경우, 사이니의 회원이 사이니에서 회원 탈퇴와 동시에 해당 분산 앱에 추가로 수집된 개인정보 또한 한번에 삭제 및 초기화 되어야 합니다. 회원은 해당 분산 앱이 규정하는 별도의 절차를 통해 회원정보와 맞춤 정보 삭제 여부를 확인할 권리를 가집니다.

2. 회원이 다음 각 호의 사유에 해당하면, 사이니는 회원자격을 상실시킬 수 있습니다.
1). 다른 사람의 서비스 이용을 방해하거나 타인의 명예를 훼손하거나 그 정보를 도용하는 등 전자 거래 및 정보통신서비스 이용질서를 위협하는 경우
2). 허락되지 않은 홍보행위 또는 영업 행위를 위한 장소로 이용하는 경우
3). 제공되는 정보를 변경하는 등 사이니의 운영을 방해한 경우
4). 법령과 본 약관이 금지하거나 미풍양속에 저해하는 행위를 하는 경우
5). 기타 회원의 자격을 지속시키는 것이 부적절하다고 판단되는 경우


제3장 서비스이용

제8조 (서비스의 내용)

1. 사이니는 다음의 서비스를 제공합니다.
1). 일반 안내 서비스
2). 분산 ID 서비스 제공자의 연동을 통한 사이니의 회원 정보 연결 및 갱신, 유지와 관리 서비스
3). 사이니의 서비스와 연동되는 또다른 블록체인이나 분산 앱과의 회원 정보 및 맞춤 정보의 연결과 갱신, 유지와 관리 서비스
4). 사이니의 서비스와 연동되는 비블록체인 방식의 서비스 제공자와의 연결에 필요한 제반 서비스
5). 자산 저장, 교환 및 출금 서비스
6). 기타 사이니가 정하는 서비스


제9조 (서비스 이용개시)

1. 사이니는 회윈의 이용신청을 승낙한 때부터 서비스를 개시합니다. 단, 일부 서비스의 경우에는 지정된 일자부터 서비스를 개시합니다.

2. 사이니의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 사이트에 공시하거나 회원에게 이를 통지합니다.

제10조 (서비스의 변경 및 중지)

1. 사이니는 변경될 서비스의 내용 및 제공일자를 제12조에서 정한 방법으로 회원에게 통지하고 서비스를 변경하여 제공할 수 있습니다.

2. 사이니는 다음 각 호에 해당하면 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
1). 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
2). 회원이 사이니의 서비스 및 영업활동을 방해하는 경우
3). 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
4). 서비스 제공업자와의 계약 종료 등과 같은 사이니의 제반 사정으로 서비스를 유지할 수 없는 경우
5). 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우

3. 제2항에 의한 서비스 중단의 경우에는 사이니는 제12조에서 정한 방법으로 이용자에게 통지합니다.
다만, 사이니가 통제할 수 없는 사유로 인한 서비스의 중단(운영자의 고의나 과실이 없는 전산장비 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.

4. 사이니는 이용자의 게시 또는 전송한 자료의 내용 및 서비스의 변경, 중지에 발생하는 문제에 대해서는 어떠한 책임도 지지 않습니다.

제11조 (서비스에 관한 책임과 제한)

1. 분산 ID 연결 서비스
1). 사이니가 다른 분산 ID 서비스 제공자로부터 획득한 정보가 아닌 사이니가 직접 제공하는 서비스로부터 추가로 획득한 이용자의 정보는 블록체인과 스마트 컨트랙트에 저장합니다. 
2). 이때 사이니는 사이니가 직접 제공하는 전산장비와 블록체인 관련 시스템에 해당 정보가 안정적으로 연결되고 유지될 수 있도록 노력합니다.

2. 자산 지갑 서비스
1). 회원의 자산을 저장할 수 있는 안정적이고 높은 보안 수준에서의 내부 또는 외부의 블록체인 관련 지갑 서비스를 제공합니다.

3. 사이니가 제공하는 서비스의 종류는 사이니의 사정에 의하여 수시로 변경될 수 있으며, 제공되는 서비스에 대한 저작권 및 지적재산권은 사이니에 귀속됩니다.

4. 사이니는 서비스와 관련하여 회원에게 사이니가 정한 이용조건에 따라 계정, 아이디, 서비스 등을 이용할 수 있는 이용권한만을 부여하며, 회원은 이를 활용한 유사 서비스 제공 및 상업적 활동을 할 수 없습니다.

5. 사이니와 연결 사이트간 관계
1). 사이니의 연결 사이트가 독자적으로 제공하는 회원 정보, 재화, 용역, 구매 및 판매, 기타 서비스에 대해서 어떠한 보증책임을 지지 않습니다.


제12조 (회원에 대한 통지)

// eslint-disable-next-line max-len
// eslint-disable-next-line max-len
// eslint-disable-next-line max-len
// eslint-disable-next-line max-len
1. 사이니는 서비스를 운영함에 있어 사이니의 서비스이용과 관련한 처리 결과 및 안내에 대한 통지를 할 수 있으며, 회원이 사이니에 제공한 이메일 주소 또는 SMS전송으로 할 수 있습니다. 단, 회원의 요청 또는 동의 여부에 따라 제한될 수 있습니다.

2. 사이니는 불특정다수 회원에 대한 통지의 경우 게시판에 게시함으로써 개별통지에 갈음할 수 있습니다.


제4장 개인정보의 보호

제13조 (개인정보의 수집 및 이용)

1. 사이니는 본 서비스의 원활한 운영을 위해 이용자로부터 최소한의 정보를 수집합니다.

2. 이용자의 개인정보를 수집하는 때에는 이하 각호의 경우를 제외하고는 당해 이용자의 동의를 받습니다.
1). 법률에 특별한 규정이 있는 경우
2). 서비스이용계약의 이행을 위해서 필요한 경우
3). 서비스의 제공에 따른 요금정산을 위하여 필요한 경우

3. 사이니는 개인정보의 보호를 위하여 관리자를 한정하여 그 수를 최소화하며 개인정보의 분실, 도난, 유출, 변조가 발생하지 않도록 안정성 유지에 필요한 기술적 조치 등을 강구합니다.

4. 제공된 개인정보는 당해 이용자의 동의 없이 목적 외 이용이나 제3자에게 제공할 수 없습니다. 단, 다음의 경우에는 예외로 합니다.
1). 법률에 특별한 규정이 있는 경우
2). 사용자 인증 절차
3). 서비스의 제공에 따른 경품 배송등을 위하여 필요한 경우
4). 서비스의 원활한 운영을 위한 보조 지표 및 설문 조사 결과 자료로 활용
5). 통계작성 또는 학술연구나 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우

5. 사이니는 개인정보의 수집목적을 달성한 때에는 당해 개인정보를 바로 파기합니다.

6. 쿠키(cookie)의 운영에 관한 사항
① 사이니는 분산 ID 시스템의 원칙에 부응하고 개별적인 맞춤서비스를 제공하기 위해 이용자로부터 최소한의 이용 정보를 획득, 이를 이용자의 로컬 전자장비에 저장하며 필요 시 해당 정보를 읽어들이는 제한된 ‘쿠키(cookie)’ 이용 방식을 사용합니다. 쿠키는 이용자의 컴퓨터는 구별하지만 이용자를 개인적으로 식별하지는 않습니다.
1). 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 
2). 쿠키의 설치와 운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부할 수 있습니다. 
3). 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.


제14조 (이용자의 권리)

1. 이용자는 언제든지 제13조2항의 규정에 의한 동의를 철회할 수 있습니다. 단, 철회의 의사표시는 사이니 또는 사이니로부터 정보를 제공 받은 자에게 전자우편이 도달된 때부터 유효합니다.

2. 이용자는 사이니에게 자신의 개인정보에 대한 열람을 요구할 수 있으며, 자신의 개인정보에 오류가 있는 경우 사이니의 개인화 서비스를 통해 자신이 직접 정정할 수 있으며 회원이 해당 작업을 직접 수행할 수 없는 경우 사이니에 그 정정을 요구할 수 있습니다.

3. 제1항 및 제2항에 의한 철회, 열람, 정정의 요구는 사이니에 전자우편을 보내는 방식으로 하여야 하며, 사이니는 전자우편이 도달된 후 지체 없이 필요한 조치를 취할 의무를 집니다.
이용자가 오류의 정정을 요구한 경우에는 사이니는 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.


제5장 의무 및 책임

제15조 (사이니의 의무)

1. 사이니는 관련법과 본 약관에 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 본 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하는 데 최선을 다합니다.

2. 사이니는 블록체인과 스마트 컨트랙트를 통해 저장되거나 조회되는 정보를 제외하고 이용자의 금융 정보를 포함한 개인신상 정보의 보안에 대하여 기술적 안전 조치를 강구하고 관리에 만전을 기함으로써 이용자의 정보보안에 최선을 다합니다.

3. 사이니는 서비스의 제공과 관련하여 알게 된 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위해 노력합니다. 회원의 개인정보보호 및 사용에 대해서는 관련법 및 개인정보취급방침에 따릅니다.

4. 사이니는 서비스 제공 상의 중대한 이유를 제외하고는 안정적인 운영과 지속적인 연구개발을 통해 서비스 이용 고객의 만족과 블록체인 생태계 발전에 기여합니다.

5. 사이니는 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.

제16조 (이용자의 의무)

1. 이용자는 사이니가 정하거나 유사한 서비스 관점에서 허용 가능한 범위를 넘어서는 다음의 행위를 하여서는 안됩니다.
1). 서비스를 방해하는 비정상적인 회원 가입 또는 탈퇴, 서비스 이용 도중 제반의 악의적인 행위
2). 타인의 정보 도용
3). 서비스 제공 절차를 악용한 정보의 생성과 신청 또는 변경과 작성
4). 사이니가 정한 정보 이외의 정보(컴퓨터 문서 및 파일, 프로그램 등)등의 송신 또는 게시
5). 사이니와 기타 제3자의 저작권 등 지적재산권에 대한 침해
6). 사이니와 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
7). 외설 또는 폭력적인 메시지나 화상과 음성 등 미풍양속에 반하는 정보를 사이니에 공개 또는 게시하는 행위
8). 다른 이용자에 대한 홍보활동 및 영업을 하거나 알선하는 행위
9). 제3자의 상품 및 서비스를 선전하는 행위
10). 상품을 판매하거나 판매를 알선하는 행위
11). 사이니의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
12). 기타 불법적이거나 부당한 행위


2. 전항 각 호의 정보 또는 기타 사이니가 사이트 운영상 부적절하다고 판단한 정보가 홈페이지에 게시되거나, 사이트와 링크된 곳에 게시된 경우,
사이니는 이용자 또는 기타 정보의 게시를 행한 자의 승낙 없이 홈페이지에 게재된 당해 정보를 삭제하거나 링크를 단절할 수 있습니다. 단, 사이니는 이러한 정보의 삭제나 링크의 절단 등을 할 의무를 지지는 않습니다.

제17조 (양도금지)
회원 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도, 증여할 수 없으며 게시물에 대한 저작권을 포함한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.



제6장 기 타

제18조 (저작권의 귀속 및 이용 제한)

1. 사이니가 작성한 저작물에 대한 저작권 기타 지적재산권은 사이니에 귀속합니다.

2. 이용자는 홈페이지를 이용함으로써 얻은 정보를 사이니의 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.

제19조 (분쟁 해결)

1. 본 이용약관에 규정된 것을 제외하고 발생하는 서비스 이용에 관한 제반 문제에 관한 분쟁은 최대한 합의를 통해 해결하도록 합니다.

2. 이용자가 서비스 이용과 관련하여 불만이 있거나 의견을 제시하고자 하는 경우에는 전자우편으로 서비스에 대한 불만사항 또는 의견을 제출할 수 있습니다.

3. 사이니는 이용자로부터 제출되는 불만사항 및 의견이 정당하다고 판단하는 경우, 우선으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 빠른 시일 내에 통보합니다.

제20조 (재판권 및 준거법)
1. 사이니와 이용자 간에 서비스 이용으로 발생한 분쟁에 관한 소송은 민사소송법상의 관할법원으로 합니다.
2. 사이니와 이용자 간에 제기된 전자거래 소송에는 한국법을 적용합니다.

부칙
이 약관은 2019년 10월 25일부터 적용됩니다.
`;

export {PrivacyPolicy, TermsOfUse};
